#
# US English Error messages for Universal Connection Pool
#
# Note:
# - Error codes are defined in UCPErrorHandler.java.
#
# Message Guidelines:
# (The existing messages are not consistent, but do follow this guideline
# when you are creating new ones, or changing old ones.)
#
# - Do not put signs in messages.  This is bad: "-> NULL".
# - Use past-tense (e.g., "failed to convert data").
#

#--------------------------------------------------------------------------
#
# Messages
#
#--------------------------------------------------------------------------

UCP-45001=Vnit\u0159n\u00ED chyba fondu Universal Connection Pool

UCP-45002=Ve fondu Universal Connection Pool nejsou k dispozici \u017E\u00E1dn\u00E1 p\u0159ipojen\u00ED

UCP-45003=Fond Universal Connection Pool ji\u017E existuje

UCP-45004=Neplatn\u00E9 informace o na\u010Dten\u00ED p\u0159ipojen\u00ED

UCP-45005=Zp\u011Btn\u00E9 vol\u00E1n\u00ED je ji\u017E zaregistrov\u00E1no

UCP-45006=Neplatn\u00E1 konfigurace fondu Universal Connection Pool


UCP-45051=Nepoda\u0159ilo se napl\u00E1novat \u010Dasova\u010D \u010Dasov\u00E9ho limitu neaktivn\u00EDho p\u0159ipojen\u00ED

UCP-45052=Nepoda\u0159ilo se napl\u00E1novat \u010Dasova\u010D \u010Dasov\u00E9ho limitu p\u0159eru\u0161en\u00E9ho p\u0159ipojen\u00ED

UCP-45053=Nepoda\u0159ilo se napl\u00E1novat \u010Dasova\u010D \u010Dasov\u00E9ho limitu doby trv\u00E1n\u00ED p\u0159ipojen\u00ED

UCP-45054=Universal Connection Pool nesm\u00ED b\u00FDt null

UCP-45055=P\u0159i odeb\u00EDr\u00E1n\u00ED dostupn\u00E9ho p\u0159ipojen\u00ED do\u0161lo k chyb\u011B

UCP-45056=Nen\u00ED k dostupn\u00E9 \u017E\u00E1dn\u00E9 platn\u00E9 p\u0159ipojen\u00ED

UCP-45057=Objekt AvailableConnections nesm\u00ED b\u00FDt null

UCP-45058=Objekt Failoverable nesm\u00ED b\u00FDt null

UCP-45059=Parametr MaxPoolsize je nastaven na hodnotu 0. Nelze vr\u00E1tit \u017E\u00E1dn\u00E1 p\u0159ipojen\u00ED

UCP-45060=Neplatn\u00FD status \u017Eivotn\u00EDho cyklu. Zkontrolujte status fondu Universal Connection Pool

UCP-45061=Fond Universal Connection Pool nen\u00ED spu\u0161t\u011Bn. P\u0159ed p\u0159\u00EDstupem fond Universal Connection Pool spus\u0165te

UCP-45062=Shrom\u00E1\u017Ed\u011Bn\u00ED dostupn\u00FDch p\u0159ipojen\u00ED lze nastavit pouze v p\u0159\u00EDpad\u011B, \u017Ee je fond Universal Connection Pool ve stavu inicializace

UCP-45063=Fond Universal Connection Pool byl p\u0159i pokusu o z\u00EDsk\u00E1n\u00ED p\u0159ipojen\u00ED ukon\u010Den

UCP-45064=V\u0161echna p\u0159ipojen\u00ED ve fondu Universal Connection Pool se pou\u017E\u00EDvaj\u00ED

UCP-45066=B\u011Bhem spou\u0161t\u011Bn\u00ED fondu se nepoda\u0159ilo vytvo\u0159it initialPoolSize p\u0159ipojen\u00ED

UCP-45091=Zp\u011Btn\u00E9 vol\u00E1n\u00ED popisk\u016F p\u0159ipojen\u00ED je ji\u017E zaregistrov\u00E1na

UCP-45092=Vyp\u016Fj\u010Den\u00ED p\u0159ipojen\u00ED s popiskem bez zaregistrov\u00E1n\u00ED zp\u011Btn\u00E9ho vol\u00E1n\u00ED popisk\u016F

UCP-45093=Bylo po\u017Eadov\u00E1no p\u0159ipojen\u00ED bez popisku, z\u00E1rove\u0148 v\u0161ak bylo vyp\u016Fj\u010Deno p\u0159ipojen\u00ED s popiskem

UCP-45097=Nepoda\u0159ilo se napl\u00E1novat \u010Dasova\u010D recyklace p\u0159ipojen\u00ED


UCP-45100=ConnectionFactoryAdapter vr\u00E1til hodnotu null

UCP-45103=ConnectionFactoryAdapter mus\u00ED b\u00FDt instanc\u00ED objektu DataSourceConnectionFactoryAdapter

UCP-45104=ConnectionFactoryAdapter nesm\u00ED b\u00FDt null

UCP-45105=ConnectionFactoryAdapter mus\u00ED b\u00FDt instanc\u00ED objektu ConnectionPoolDataSourceConnectionFactoryAdapter

UCP-45106=ConnectionFactoryAdapter mus\u00ED b\u00FDt instanc\u00ED objektu XADataSourceConnectionFactoryAdapter


UCP-45150=UniversalPooledConnection nesm\u00ED b\u00FDt null

UCP-45151=Neplatn\u00FD p\u0159\u00EDkaz SQL pro ov\u011B\u0159en\u00ED platnosti p\u0159ipojen\u00ED

UCP-45152=UniversalPooledConnectionStatus nesm\u00ED b\u00FDt null

UCP-45153=Kl\u00ED\u010D popisku p\u0159ipojen\u00ED nesm\u00ED b\u00FDt null ani pr\u00E1zdn\u00FD \u0159et\u011Bzec

UCP-45154=Operaci popisku p\u0159ipojen\u00ED nelze volat u uzav\u0159en\u00FDch p\u0159ipojen\u00ED

UCP-45155=Zp\u011Btn\u00E9 vol\u00E1n\u00ED recyklace p\u0159ipojen\u00ED je ji\u017E zaregistrov\u00E1no

UCP-45156=Zp\u011Btn\u00E9 vol\u00E1n\u00ED \u010Dasov\u00E9ho limitu p\u0159eru\u0161en\u00E9ho p\u0159ipojen\u00ED je ji\u017E zaregistrov\u00E1no

UCP-45157=Zp\u011Btn\u00E9 vol\u00E1n\u00ED \u010Dasov\u00E9ho limitu doby trv\u00E1n\u00ED p\u0159ipojen\u00ED je ji\u017E zaregistrov\u00E1no


UCP-45201=Kl\u00ED\u010D popisku p\u0159ipojen\u00ED nesm\u00ED b\u00FDt null ani pr\u00E1zdn\u00FD \u0159et\u011Bzec

UCP-45202=Klonov\u00E1n\u00ED objektu ConnectionRetrievalInfo se nezda\u0159ilo

UCP-45203=Informace o po\u017Eadavku p\u0159ipojen\u00ED jsou null

UCP-45251=ConnectionPoolDataSource nesm\u00ED b\u00FDt null

UCP-45252=Neplatn\u00FD objekt ConnectionRetrievalInfo

UCP-45253=P\u0159i z\u00EDsk\u00E1v\u00E1n\u00ED p\u0159ipojen\u00ED PooledConnection z datov\u00E9ho zdroje ConnectionPoolDataSource do\u0161lo k v\u00FDjimce SQLException

UCP-45254=Typ p\u0159ipojen\u00ED nen\u00ED platn\u00FD. Mus\u00ED b\u00FDt nastaven typ javax.sql.PooledConnection

UCP-45255=P\u0159i uzav\u00EDr\u00E1n\u00ED p\u0159ipojen\u00ED PooledConnection do\u0161lo k v\u00FDjimce SQLException

UCP-45256=Zdroj dat nesm\u00ED b\u00FDt null

UCP-45257=Nelze z\u00EDskat p\u0159ipojen\u00ED z datov\u00E9ho zdroje

UCP-45258=Typ p\u0159ipojen\u00ED nen\u00ED platn\u00FD. Mus\u00ED b\u00FDt nastaven typ java.sql.Connection

UCP-45259=P\u0159ipojen\u00ED k serveru proxy mus\u00ED b\u00FDt instanc\u00ED objektu java.sql.Connection

UCP-45260=XADatasource nesm\u00ED b\u00FDt null

UCP-45261=P\u0159i z\u00EDsk\u00E1v\u00E1n\u00ED p\u0159ipojen\u00ED XAConnection z datov\u00E9ho zdroje XADataSource do\u0161lo k v\u00FDjimce SQLException

UCP-45262=Typ p\u0159ipojen\u00ED nen\u00ED platn\u00FD. Mus\u00ED b\u00FDt nastaven typ javax.sql.XAConnection

UCP-45263=P\u0159i zav\u00EDr\u00E1n\u00ED p\u0159ipojen\u00ED XAConnection do\u0161lo k v\u00FDjimce SQLException

UCP-45264=P\u0159ipojen\u00ED nesm\u00ED b\u00FDt null

UCP-45265=P\u0159ipojen\u00ED k serveru proxy mus\u00ED b\u00FDt instanc\u00ED objektu java.sql.Statement

UCP-45266=P\u0159\u00EDkaz serveru proxy mus\u00ED b\u00FDt instanc\u00ED objektu java.sql.ResultSet

UCP-45267=P\u0159ipojen\u00ED k serveru proxy mus\u00ED b\u00FDt instanc\u00ED objektu javax.sql.XAConnection

UCP-45268=Argument Driver nem\u016F\u017Ee m\u00EDt hodnotu null

UCP-45269=Argument adresy URL nem\u016F\u017Ee m\u00EDt hodnotu null.

UCP-45270=Zp\u011Btn\u00E9 vol\u00E1n\u00ED inicializace p\u0159ipojen\u00ED je ji\u017E zaregistrov\u00E1no

UCP-45271=Zp\u011Btn\u00E9 vol\u00E1n\u00ED inicializace selhalo


UCP-45301=Nelze z\u00EDskat p\u0159ipojen\u00ED pro informace o operaci failover (p\u0159echod na z\u00E1lo\u017En\u00ED datab\u00E1zi)

UCP-45302=Nelze z\u00EDskat informace o operaci failover (p\u0159echod na z\u00E1lo\u017En\u00ED datab\u00E1zi) spu\u0161t\u011Bn\u00EDm dotazu SQL

UCP-45303=P\u0159i z\u00EDsk\u00E1v\u00E1n\u00ED informac\u00ED o operaci failover (p\u0159echod na z\u00E1lo\u017En\u00ED datab\u00E1zi) do\u0161lo k v\u00FDjimce SQLException

UCP-45304=Typ ud\u00E1losti nesm\u00ED b\u00FDt null

UCP-45305=Typ ud\u00E1losti je neplatn\u00FD. Ud\u00E1lost mus\u00ED b\u00FDt typu datab\u00E1ze/ud\u00E1lost/hostitelsk\u00FD po\u010D\u00EDta\u010D nebo datab\u00E1ze/ud\u00E1lost/slu\u017Eba

UCP-45306=Typ ud\u00E1losti failover (p\u0159echod na z\u00E1lo\u017En\u00ED datab\u00E1zi) nen\u00ED platn\u00FD. Mus\u00ED se jednat o typ OracleFailoverEvent

UCP-45307=Kontext p\u0159\u00EDbuznosti nen\u00ED platn\u00FD. Mus\u00ED se jednat o kontext OracleConnectionAffinityContext

UCP-45308=Do\u0161lo k v\u00FDjimce p\u0159i povolov\u00E1n\u00ED operace p\u0159echodu (failover) se vzd\u00E1lenou subskripc\u00ED ONS

UCP-45309=Vol\u00E1n\u00ED beginRequest selhalo

UCP-45310=Vol\u00E1n\u00ED endRequest selhalo

UCP-45311=Nen\u00ED k dispozici \u017E\u00E1dn\u00E9 odpov\u00EDdaj\u00EDc\u00ED p\u0159ipojen\u00ED pro p\u0159esn\u00FD vztah


UCP-45350=Fond Universal Connection Pool ji\u017E existuje ve spr\u00E1vci Universal Connection Pool Manager. Nelze ho proto do n\u011Bj p\u0159idat

UCP-45351=Fond Universal Connection Pool nebyl nalezen ve spr\u00E1vci Universal Connection Pool Manager. Zaregistrujte fond Universal Connection Pool ve spr\u00E1vci Universal Connection Pool Manager

UCP-45352=Nelze z\u00EDskat instanci spr\u00E1vce Universal Connection Pool Manager

UCP-45353=Nelze z\u00EDskat instanci objektu MBean spr\u00E1vce Universal Connection Pool Manager

UCP-45354=Parametr ObjectName objektu MBean nen\u00ED ve spr\u00E1vn\u00E9m form\u00E1tu. K vytvo\u0159en\u00ED parametru ObjectName objektu MBean pou\u017Eijte spr\u00E1vn\u00FD form\u00E1t

UCP-45355=P\u0159i registraci nebo zru\u0161en\u00ED registrace objektu MBean do\u0161lo k v\u00FDjimce objektu MBean

UCP-45356=Objekt MBean ji\u017E na serveru MBeanServer existuje. Pou\u017Eijte k zaregistrov\u00E1n\u00ED objektu MBean jin\u00FD n\u00E1zev

UCP-45357=P\u0159i pokusu o registraci objektu, kter\u00FD nen\u00ED objekt MBean kompatibiln\u00ED s technologi\u00ED JMX, na serveru MBean do\u0161lo k v\u00FDjimce

UCP-45358=Zadan\u00FD objekt MBean neexistuje v \u00FAlo\u017Ei\u0161ti

UCP-45359=Je zad\u00E1n neplatn\u00FD c\u00EDlov\u00FD typ objektu. Zkontrolujte spravovan\u00FD zdroj

UCP-45360=Je zad\u00E1n neplatn\u00FD deskriptor objektu MBean. Zkontrolujte deskriptor MBean spr\u00E1vce Universal Connection Pool

UCP-45361=P\u0159i vytv\u00E1\u0159en\u00ED t\u0159\u00EDdy MBeanInfo pro objekt MBean spr\u00E1vce Universal Connection Pool Manager do\u0161lo k runtime v\u00FDjimce

UCP-45362=P\u0159i vytv\u00E1\u0159en\u00ED informac\u00ED o konstruktorech pro objekt MBean spr\u00E1vce Universal Connection Pool Manager do\u0161lo k runtime v\u00FDjimce

UCP-45363=P\u0159i vytv\u00E1\u0159en\u00ED informac\u00ED o atributech pro objekt MBean spr\u00E1vce Universal Connection Pool Manager do\u0161lo k runtime v\u00FDjimce

UCP-45364=P\u0159i vytv\u00E1\u0159en\u00ED informac\u00ED o operac\u00EDch pro objekt MBean spr\u00E1vce Universal Connection Pool Manager do\u0161lo k runtime v\u00FDjimce

UCP-45365=Fond Universal Connection Pool mus\u00ED b\u00FDt instanc\u00ED objektu ConnectionConnectionPool nebo OracleConnectionConnectionPool

UCP-45366=Byl zad\u00E1n neplatn\u00FD deskriptor objektu MBean. Zkontrolujte deskriptor objektu MBean fondu Universal Connection Pool JDBC

UCP-45367=P\u0159i vytv\u00E1\u0159en\u00ED t\u0159\u00EDdy MBeanInfo pro objekt MBean fondu Universal Connection Pool JDBC do\u0161lo k runtime v\u00FDjimce

UCP-45368=P\u0159i vytv\u00E1\u0159en\u00ED informac\u00ED o konstruktorech pro objekt MBean fondu Universal Connection Pool JDBC do\u0161lo k runtime v\u00FDjimce

UCP-45369=P\u0159i vytv\u00E1\u0159en\u00ED informac\u00ED o atributech pro objekt MBean fondu Universal Connection Pool JDBC do\u0161lo k runtime v\u00FDjimce

UCP-45370=P\u0159i vytv\u00E1\u0159en\u00ED informac\u00ED o operac\u00EDch pro objekt MBean fondu Universal Connection Pool JDBC do\u0161lo k runtime v\u00FDjimce

UCP-45371=P\u0159i vytv\u00E1\u0159en\u00ED informac\u00ED o atributech pro objekt MBean fondu Universal Connection Pool do\u0161lo k runtime v\u00FDjimce

UCP-45372=P\u0159i vytv\u00E1\u0159en\u00ED informac\u00ED o operac\u00EDch pro objekt MBean fondu Universal Connection Pool do\u0161lo k runtime v\u00FDjimce

UCP-45373=Byl zad\u00E1n neplatn\u00FD deskriptor objektu MBean. Zkontrolujte deskriptor objektu MBean fondu Universal Connection Pool

UCP-45374=P\u0159i vytv\u00E1\u0159en\u00ED t\u0159\u00EDdy MBeanInfo pro objekt MBean fondu Universal Connection Pool do\u0161lo k runtime v\u00FDjimce

UCP-45375=Nelze zastavit shroma\u017E\u010Fov\u00E1n\u00ED metrik UCP. P\u0159i pokusu o ukon\u010Den\u00ED sb\u011Bru metrik nebo ru\u0161en\u00ED jmen \u010Di senzor\u016F do\u0161lo k v\u00FDjimce.

UCP-45376=Pl\u00E1nov\u00E1n\u00ED \u00FAlohy \u010Dasova\u010De aktualizace metriky selhalo

UCP-45377=Do\u0161lo k probl\u00E9mu p\u0159i aktualizaci senzor\u016F metriky UCP

UCP-45378=Fond Universal Connection Pool nen\u00ED instanc\u00ED objektu OracleJDBCConnectionPool a nem\u016F\u017Ee pou\u017E\u00EDvat vlastnost ONSConfiguration

UCP-45379=Nelze nastavit n\u00E1zev fondu p\u0159ipojen\u00ED v objektu MBean fondu Universal Connection Pool. Zkontrolujte n\u00E1zev fondu p\u0159ipojen\u00ED a zajist\u011Bte, aby nebyl zad\u00E1n duplicitn\u00ED n\u00E1zev

UCP-45380=Objekt MBean je null

UCP-45381=N\u00E1zev objektu MBean je null

UCP-45382=Zobrazovan\u00FD n\u00E1zev objektu MBean je null

UCP-45383=Neplatn\u00FD adapt\u00E9r pro vytvo\u0159en\u00ED fondu ve spr\u00E1vci Universal Connection Pool Manager

UCP-45384=Neplatn\u00FD adapt\u00E9r pro vytvo\u0159en\u00ED fondu v objektu MBean spr\u00E1vce Universal Connection Pool Manager

UCP-45385=Chyba p\u0159i vytvo\u0159en\u00ED fondu ve spr\u00E1vci Universal Connection Pool Manager

UCP-45386=Chyba p\u0159i vytvo\u0159en\u00ED fondu v objektu MBean spr\u00E1vce Universal Connection Pool Manager


# Util and Worker Thread Pool (WTP)

UCP-45401=Doln\u00ED mez rozp\u011Bt\u00ED (LW) \u010Dek\u00E1n\u00ED na vl\u00E1kna nesm\u00ED b\u00FDt z\u00E1porn\u00E1

UCP-45402=Horn\u00ED mez rozp\u011Bt\u00ED (LW) \u010Dek\u00E1n\u00ED na vl\u00E1kna nesm\u00ED b\u00FDt z\u00E1porn\u00E1

UCP-45403=Celkov\u00FD limit pracovn\u00EDch vl\u00E1ken nesm\u00ED b\u00FDt z\u00E1porn\u00FD

UCP-45404=\u010Casov\u00FD limit dotazov\u00E1n\u00ED fronty nesm\u00ED b\u00FDt z\u00E1porn\u00FD

UCP-45405=Horn\u00ED mez (HW) \u010Dekaj\u00EDc\u00EDch vl\u00E1ken nesm\u00ED b\u00FDt ni\u017E\u0161\u00ED ne\u017E doln\u00ED mez (LW)

UCP-45406=Limit celkov\u00E9ho po\u010Dtu pracovn\u00EDch vl\u00E1ken nesm\u00ED b\u00FDt vy\u0161\u0161\u00ED ne\u017E limit \u010Dekaj\u00EDc\u00EDch vl\u00E1ken

UCP-45407=\u010C\u00EDslo chyby je mimo rozsah

UCP-45408=Operace nen\u00ED platn\u00E1, proto\u017Ee protokolovac\u00ED program je null

# SQL Messages

SQL-0=Nelze spustit fond Universal Connection Pool

SQL-1=Nelze vytvo\u0159it fond Universal Connection Pool

SQL-2=Neplatn\u00E1 minim\u00E1ln\u00ED velikost fondu

SQL-3=Neplatn\u00E1 maxim\u00E1ln\u00ED velikost fondu

SQL-4=Neplatn\u00FD \u010Dasov\u00FD limit neaktivn\u00EDho p\u0159ipojen\u00ED

SQL-5=Neplatn\u00FD \u010Dasov\u00FD limit \u010Dek\u00E1n\u00ED na p\u0159ipojen\u00ED

SQL-6=Neplatn\u00FD \u010Dasov\u00FD limit doby trv\u00E1n\u00ED p\u0159ipojen\u00ED

SQL-7=Neplatn\u00FD \u010Dasov\u00FD limit p\u0159eru\u0161en\u00E9ho p\u0159ipojen\u00ED

SQL-8=Neplatn\u00FD interval kontroly \u010Dasov\u00E9ho p\u0159ipojen\u00ED

SQL-9=Nepoda\u0159ilo se prov\u00E9st operaci failover (p\u0159echod na z\u00E1lo\u017En\u00ED datab\u00E1zi)

SQL-10=Nepoda\u0159ilo se nastavit hodnotu maxStatements

SQL-11=Nepoda\u0159ilo se nastavit \u0159et\u011Bzec SQL pro ov\u011B\u0159en\u00ED

SQL-12=Neplatn\u00FD po\u010Det trigger\u016F operac\u00ED sb\u011Bru dat p\u0159ipojen\u00ED

SQL-13=Neplatn\u00FD maxim\u00E1ln\u00ED po\u010Det operac\u00ED sb\u011Bru dat p\u0159ipojen\u00ED

SQL-14=Fond Universal Connection Pool je ji\u017E vytvo\u0159en. Nelze ho vytvo\u0159it znovu

SQL-15=P\u0159i odstra\u0148ov\u00E1n\u00ED fondu Universal Connection Pool do\u0161lo k v\u00FDjimce

SQL-16=Operace se vztahuje pouze na fondy p\u0159ipojen\u00ED Oracle

SQL-17=P\u0159i nastavov\u00E1n\u00ED \u0159et\u011Bzce konfigurace ONS do\u0161lo k v\u00FDjimce

SQL-18=Nepoda\u0159ilo se zaregistrovat zp\u011Btn\u00E9 vol\u00E1n\u00ED pro popisky

SQL-19=Nepoda\u0159ilo se odebrat zp\u011Btn\u00E9 vol\u00E1n\u00ED pro popisky

SQL-20=Nepoda\u0159ilo se zaregistrovat zp\u011Btn\u00E9 vol\u00E1n\u00ED p\u0159\u00EDbuznosti

SQL-21=Nepoda\u0159ilo se odebrat zp\u011Btn\u00E9 vol\u00E1n\u00ED p\u0159\u00EDbuznosti

SQL-22=Neplatn\u00E1 konfigurace fondu Universal Connection Pool

SQL-23=Nelze vytvo\u0159it instanci t\u0159\u00EDdy factory se zadan\u00FDm n\u00E1zvem t\u0159\u00EDdy factory

SQL-24=Nelze nastavit u\u017Eivatele

SQL-25=Nelze nastavit heslo

SQL-26=Nelze nastavit adresu URL

SQL-27=T\u0159\u00EDda factory mus\u00ED b\u00FDt instanc\u00ED objektu DataSource

SQL-28=Nelze vytvo\u0159it p\u0159ipojen\u00ED. K dispozici nejsou \u017E\u00E1dn\u00E1 p\u0159ipojen\u00ED

SQL-29=P\u0159i z\u00EDsk\u00E1v\u00E1n\u00ED p\u0159ipojen\u00ED do\u0161lo k v\u00FDjimce

SQL-30=Fond Universal Connection Pool nen\u00ED spu\u0161t\u011Bn

SQL-31=P\u0159ipojen\u00ED je zav\u0159eno

SQL-32=P\u0159i operaci pou\u017Eit\u00ED popisku do\u0161lo k chyb\u011B

SQL-33=P\u0159i odeb\u00EDr\u00E1n\u00ED popisku p\u0159ipojen\u00ED do\u0161lo k chyb\u011B

SQL-34=P\u0159i z\u00EDsk\u00E1v\u00E1n\u00ED popisk\u016F do\u0161lo k chyb\u011B

SQL-35=P\u0159i z\u00EDsk\u00E1v\u00E1n\u00ED neshodn\u00FDch popisk\u016F do\u0161lo k chyb\u011B

SQL-36=P\u0159i nastavov\u00E1n\u00ED povolen\u00ED sb\u011Bru dat u p\u0159ipojen\u00ED do\u0161lo k chyb\u011B

SQL-37=P\u0159i registraci zp\u011Btn\u00E9ho vol\u00E1n\u00ED recyklace do\u0161lo k chyb\u011B

SQL-38=P\u0159i odeb\u00EDr\u00E1n\u00ED zp\u011Btn\u00E9ho vol\u00E1n\u00ED recyklace do\u0161lo k chyb\u011B

SQL-39=P\u0159i registraci zp\u011Btn\u00E9ho vol\u00E1n\u00ED p\u0159eru\u0161en\u00E9ho p\u0159ipojen\u00ED do\u0161lo k chyb\u011B

SQL-40=P\u0159i odeb\u00EDr\u00E1n\u00ED zp\u011Btn\u00E9ho vol\u00E1n\u00ED p\u0159eru\u0161en\u00E9ho p\u0159ipojen\u00ED do\u0161lo k chyb\u011B

SQL-41=P\u0159i registraci zp\u011Btn\u00E9ho vol\u00E1n\u00ED doby trv\u00E1n\u00ED p\u0159ipojen\u00ED do\u0161lo k chyb\u011B

SQL-42=P\u0159i odeb\u00EDr\u00E1n\u00ED zp\u011Btn\u00E9ho vol\u00E1n\u00ED doby trv\u00E1n\u00ED p\u0159ipojen\u00ED do\u0161lo k chyb\u011B

SQL-43=Objekt ResultSet je uzav\u0159en

SQL-44=P\u0159\u00EDkaz je uzav\u0159en

SQL-45=Nelze nastavit n\u00E1zev fondu p\u0159ipojen\u00ED. Zkontrolujte n\u00E1zev fondu p\u0159ipojen\u00ED a zajist\u011Bte, aby nebyl zad\u00E1n duplicitn\u00ED n\u00E1zev

SQL-46=\u0158et\u011Bzec SQL je null

SQL-47=P\u0159i operaci, p\u0159i kter\u00E9 m\u011Blo b\u00FDt p\u0159epojen\u00ED nastaveno jako neplatn\u00E9, do\u0161lo k chyb\u011B

SQL-48=Nelze nastavit vlastnosti p\u0159ipojen\u00ED

SQL-49=Nelze nastavit n\u00E1zev datab\u00E1zov\u00E9ho serveru

SQL-50=Nelze nastavit \u010D\u00EDslo portu datab\u00E1ze

SQL-51=Nelze nastavit n\u00E1zev datab\u00E1ze

SQL-52=Nelze nastavit n\u00E1zev datov\u00E9ho zdroje

SQL-53=Nelze nastavit popis datov\u00E9ho zdroje

SQL-54=Nelze nastavit s\u00ED\u0165ov\u00FD protokol DataSource

SQL-55=Nelze nastavit n\u00E1zev role DataSource

SQL-56=Neplatn\u00E1 hodnota pro \u010Das opakovan\u00E9ho pou\u017Eit\u00ED p\u0159ipojen\u00ED

SQL-57=Neplatn\u00E1 hodnota pro maxim\u00E1ln\u00ED po\u010Det opakovan\u00E9ho pou\u017Eit\u00ED p\u0159ipojen\u00ED

SQL-58=Metoda je zak\u00E1z\u00E1na

SQL-59=Nelze nastavit vlastnosti p\u0159ipojen\u00ED factory

SQL-60=Nepoda\u0159ilo se zaregistrovat zp\u011Btn\u00E9 vol\u00E1n\u00ED inicializace

SQL-61=Nepoda\u0159ilo se odebrat zp\u011Btn\u00E9 vol\u00E1n\u00ED inicializace

SQL-62=Argument nen\u00ED rozhran\u00ED

SQL-63=Neplatn\u00E1 hodnota pro ozna\u010Dov\u00E1n\u00ED vysok\u00FDch n\u00E1klad\u016F p\u0159ipojen\u00ED

SQL-64=Neplatn\u00E1 prahov\u00E1 hodnota opakovan\u00E9ho pou\u017Eit\u00ED p\u0159ipojen\u00ED s vysok\u00FDmi n\u00E1klady

SQL-65=Ve zp\u011Btn\u00E9m vol\u00E1n\u00ED inicializace je p\u0159ipojen\u00ED s hodnotou null

SQL-66=Neplatn\u00FD typ p\u0159ipojen\u00ED ve zp\u011Btn\u00E9m vol\u00E1n\u00ED inicializace

#
# Add all error messages above here
#


# Below are MBean descriptions. They do not follow the message guidelines.

#--------------------------------------------------------------------------
#
# UniversalConnectionPoolManagerMBean descriptions
#
#--------------------------------------------------------------------------

#Pool Manager MBean AttributeInfo

#Attribute for MetricUpdateInterval 
MetricUpdateIntervalAttrDisplayName=MetricUpdateInterval
MetricUpdateIntervalAttrDescription=Nastav\u00ED a z\u00EDsk\u00E1 hodnotu intervalu aktualizace metriky

#Attribute for LogLevel
LogLevelAttrDisplayName=LogLevel
LogLevelAttrDescription=Nastav\u00ED a z\u00EDsk\u00E1 \u00FArove\u0148 protokolu UCP

#Pool Manager MBean OperationsInfo

#Operation to start connection pool
StartConnectionPoolOperationDescription=Spust\u00ED fond Universal Connection Pool

#Operation to stop connection pool
StopConnectionPoolOperationDescription=Zastav\u00ED fond Universal Connection Pool

#Operation to destroy connection pool
DestroyConnectionPoolOperationDescription=Odstran\u00ED fond Universal Connection Pool

#Operation to start the metric collection
StartMetricCollectionOperationDescription=Spust\u00ED shroma\u017E\u010Fov\u00E1n\u00ED metrik

#Operation to stop the metric collection
StopMetricCollectionOperationDescription=Zastav\u00ED shroma\u017E\u010Fov\u00E1n\u00ED metrik

#Operation to refresh connection pool
RefreshConnectionPoolOperationDescription=Obnov\u00ED fond Universal Connection Pool

#Operation to recycle connection pool
RecycleConnectionPoolOperationDescription=Recykluje fond Universal Connection Pool

#Operation to purge connection pool
PurgeConnectionPoolOperationDescription=Vypr\u00E1zdn\u00ED fond Universal Connection Pool

#Operation to get the list of connection pool names
GetConnectionPoolNamesOperationDescription=Z\u00EDsk\u00E1 seznam n\u00E1zv\u016F fondu Universal Connection Pool

#Operation to get the life cycle state of the connection pool
GetConnectionPoolLifeCycleStateOperationDescription=Z\u00EDsk\u00E1 stav \u017Eivotn\u00EDho cyklu fondu Universal Connection Pool

#Operation to get the metric update interval
GetMetricUpdateIntervalOperationDescription=Z\u00EDsk\u00E1 hodnotu intervalu aktualizace metriky

#Operation to set the metric update interval
SetMetricUpdateIntervalOperationDescription=Nastav\u00ED hodnotu intervalu aktualizace metriky

#Operation to get the log level
GetLogLevelOperationDescription=Z\u00EDsk\u00E1 hodnotu LogLevel fondu UCP

#Operation to set the log level
SetLogLevelOperationDescription=Nastav\u00ED hodnotu LogLevel fondu UCP

#Operation to create a connection pool
CreateConnectionPoolOperationDescription=Vytvo\u0159\u00ED fond Universal Connection Pool

#Operation to get the MBean Name for Connection Pool MBean
GetMBeanNameForConnectionPool=Z\u00EDsk\u00E1 n\u00E1zev MBean pro objekt MBean fondu Universal Connection Pool

#--------------------------------------------------------------------------
#
# UniversalConnectionPoolMBeanBase descriptions
#
#--------------------------------------------------------------------------

#UniversalConnectionPoolMBeanBase AttributeInfo

#Attribute for PoolName 
PoolNameAttrDisplayName=PoolName
PoolNameAttrDescription=Nastav\u00ED a z\u00EDsk\u00E1 hodnotu Name fondu Universal Connection Pool

#Attribute for InitialPoolSize 
InitialPoolSizeAttrDisplayName=InitialPoolSize
InitialPoolSizeAttrDescription=Nastav\u00ED a z\u00EDsk\u00E1 hodnotu vlastnosti po\u010D\u00E1te\u010Dn\u00ED velikosti fondu Universal Connection Pool

#Attribute for MinPoolSize 
MinPoolSizeAttrDisplayName=MinPoolSize
MinPoolSizeAttrDescription=Nastav\u00ED a z\u00EDsk\u00E1 hodnotu vlastnosti minim\u00E1ln\u00ED velikosti fondu Universal Connection Pool

#Attribute for MaxPoolSize 
MaxPoolSizeAttrDisplayName=MaxPoolSize
MaxPoolSizeAttrDescription=Nastav\u00ED a z\u00EDsk\u00E1 hodnotu vlastnosti maxim\u00E1ln\u00ED velikosti fondu Universal Connection Pool

#Attribute for InactiveConnectionTimeout 
InactiveConnectionTimeoutAttrDisplayName=InactiveConnectionTimeout
InactiveConnectionTimeoutAttrDescription=Nastav\u00ED a z\u00EDsk\u00E1 hodnotu vlastnosti inactiveConnectionTimeout

#Attribute for AbandonedConnectionTimeout 
AbandonedConnectionTimeoutAttrDisplayName=AbandonedConnectionTimeout
AbandonedConnectionTimeoutAttrDescription=Nastav\u00ED a z\u00EDsk\u00E1 hodnotu vlastnosti abandonedConnectionTimeout

#Attribute for ConnectionWaitTimeout 
ConnectionWaitTimeoutAttrDisplayName=ConnectionWaitTimeout
ConnectionWaitTimeoutAttrDescription=Nastav\u00ED a z\u00EDsk\u00E1 hodnotu vlastnosti connectionWaitTimeout

#Attribute for TimeToLiveConnectionTimeout 
TimeToLiveConnectionTimeoutAttrDisplayName=TimeToLiveConnectionTimeout
TimeToLiveConnectionTimeoutAttrDescription=Nastav\u00ED a z\u00EDsk\u00E1 hodnotu vlastnosti timeToLiveConnectionTimeout

#Attribute for TimeoutCheckInterval 
TimeoutCheckIntervalAttrDisplayName=TimeoutCheckInterval
TimeoutCheckIntervalAttrDescription=Nastav\u00ED a z\u00EDsk\u00E1 hodnotu vlastnosti timeoutCheckInterval

#Attribute for ValidateConnectionOnBorrow 
ValidateConnectionOnBorrowAttrDisplayName=ValidateConnectionOnBorrow
ValidateConnectionOnBorrowAttrDescription=Nastav\u00ED a z\u00EDsk\u00E1 hodnotu vlastnosti validateConnectionOnBorrow

#Attribute for ConnectionHarvestTriggerCount 
ConnectionHarvestTriggerCountAttrDisplayName=ConnectionHarvestTriggerCount
ConnectionHarvestTriggerCountAttrDescription=Nastav\u00ED a z\u00EDsk\u00E1 hodnotu vlastnosti connectionHarvestTriggerCount

#Attribute for ConnectionHarvestMaxCount 
ConnectionHarvestMaxCountAttrDisplayName=ConnectionHarvestMaxCount
ConnectionHarvestMaxCountAttrDescription=Nastav\u00ED a z\u00EDsk\u00E1 hodnotu vlastnosti connectionHarvestMaxCount

#Attribute for AvailableConnectionsCount 
AvailableConnectionsCountAttrDisplayName=AvailableConnectionsCount
AvailableConnectionsCountAttrDescription=Z\u00EDsk\u00E1 po\u010Det dostupn\u00FDch p\u0159ipojen\u00ED

#Attribute for BorrowedConnectionsCount 
BorrowedConnectionsCountAttrDisplayName=BorrowedConnectionsCount
BorrowedConnectionsCountAttrDescription=Z\u00EDsk\u00E1 po\u010Det vyp\u016Fj\u010Den\u00FDch p\u0159ipojen\u00ED

#Attribute for MaxConnectionReuseTime 
MaxConnectionReuseTimeAttrDisplayName=MaxConnectionReuseTime
MaxConnectionReuseTimeAttrDescription=Nastav\u00ED a z\u00EDsk\u00E1 hodnotu vlastnosti maxConnectionReuseTime

#Attribute for MaxConnectionReuseCount
MaxConnectionReuseCountAttrDisplayName=MaxConnectionReuseCount
MaxConnectionReuseCountAttrDescription=Nastav\u00ED a z\u00EDsk\u00E1 hodnotu vlastnosti maxConnectionReuseCount

#UniversalConnectionPoolMBeanBase OperationsInfo

#Operation to start the pool
StartOperationDescription=Spust\u00ED fond Universal Connection Pool

#Operation to stop the pool
StopOperationDescription=Zastav\u00ED fond Universal Connection Pool

#Operation to refresh the pool
RefreshOperationDescription=Obnov\u00ED fond Universal Connection Pool

#Operation to recycle the pool
RecycleOperationDescription=Recykluje fond Universal Connection Pool

#Operation to purge the pool
PurgeOperationDescription=Vypr\u00E1zdn\u00ED fond Universal Connection Pool

#Operation to get the pool name
GetNameOperationDescription=Z\u00EDsk\u00E1 hodnotu Name fondu Universal Connection Pool

#Operation to set the pool name
SetNameOperationDescription=Nastav\u00ED hodnotu Name fondu Universal Connection Pool

#Operation to get the pool initial pool size
GetInitialPoolSizeOperationDescription=Z\u00EDsk\u00E1 hodnotu vlastnosti InitialPoolSize fondu Universal Connection Pool

#Operation to set the pool initial pool size
SetInitialPoolSizeOperationDescription=Nastav\u00ED hodnotu vlastnosti InitialPoolSize fondu Universal Connection Pool

#Operation to get the pool minimum pool size
GetMinPoolSizeOperationDescription=Z\u00EDsk\u00E1 hodnotu vlastnosti MinPoolSize fondu Universal Connection Pool

#Operation to set the pool minimum pool size
SetMinPoolSizeOperationDescription=Nastav\u00ED hodnotu vlastnosti MinPoolSize fondu Universal Connection Pool

#Operation to get the pool maximum pool size
GetMaxPoolSizeOperationDescription=Z\u00EDsk\u00E1 hodnotu vlastnosti MaxPoolSize fondu Universal Connection Pool

#Operation to set the pool maximum pool size
SetMaxPoolSizeOperationDescription=Nastav\u00ED hodnotu vlastnosti MaxPoolSize fondu Universal Connection Pool

#Operation to get the inactive connection time out
GetInactiveConnectionTimeoutOperationDescription=Z\u00EDsk\u00E1 hodnotu vlastnosti InactiveConnectionTimeout

#Operation to set the inactive connection time out
setInactiveConnectionTimeoutOperationDescription=Nastav\u00ED hodnotu vlastnosti InactiveConnectionTimeout

#Operation to get the abandoned connection time out
GetAbandonedConnectionTimeoutOperationDescription=Z\u00EDsk\u00E1 hodnotu vlastnosti AbandonedConnectionTimeout

#Operation to set the abandoned connection time out
SetAbandonedConnectionTimeoutOperationDescription=Nastav\u00ED hodnotu vlastnosti AbandonedConnectionTimeout

#Operation to get the connection wait time out
GetConnectionWaitTimeoutOperationDescription=Z\u00EDsk\u00E1 hodnotu vlastnosti ConnectionWaitTimeout

#Operation to set the connection wait time out
SetConnectionWaitTimeoutOperationDescription=Nastav\u00ED hodnotu vlastnosti ConnectionWaitTimeout

#Operation to get the time to live connection wait time out
GetTimeToLiveConnectionTimeoutOperationDescription=Z\u00EDsk\u00E1 hodnotu vlastnosti TimeToLiveConnectionTimeout

#Operation to set the time to live connection wait time out
SetTimeToLiveConnectionTimeoutOperationDescription=Nastav\u00ED hodnotu vlastnosti TimeToLiveConnectionTimeout

#Operation to get the time out check interval
GetTimeoutCheckIntervalOperationDescription=Z\u00EDsk\u00E1 hodnotu vlastnosti TimeoutCheckInterval

#Operation to set the time out check interval
SetTimeoutCheckIntervalOperationDescription=Nastav\u00ED hodnotu vlastnosti TimeoutCheckInterval

#Operation to get the validate connection on borrow property
GetValidateConnectionOnBorrowOperationDescription=Z\u00EDsk\u00E1 hodnotu vlastnosti ValidateConnectionOnBorrow

#Operation to set the validate connection on borrow value
SetValidateConnectionOnBorrowOperationDescription=Nastav\u00ED hodnotu vlastnosti ValidateConnectionOnBorrow

#Operation to get the connection harvest trigger count
GetConnectionHarvestTriggerCountOperationDescription=Z\u00EDsk\u00E1 hodnotu vlastnosti ConnectionHarvestTriggerCount

#Operation to set the connection harvest trigger count
SetConnectionHarvestTriggerCountOperationDescription=Nastav\u00ED hodnotu vlastnosti ConnectionHarvestTriggerCount

#Operation to get the connection harvest maximum count
GetConnectionHarvestMaxCountOperationDescription=Z\u00EDsk\u00E1 hodnotu vlastnosti ConnectionHarvestMaxCount

#Operation to Set the connection harvest maximum count
SetConnectionHarvestMaxCountOperationDescription=Nastav\u00ED hodnotu vlastnosti ConnectionHarvestMaxCount

#Operation to get the available connections count
GetAvailableConnectionsCountOperationDescription=Z\u00EDsk\u00E1 po\u010Det dostupn\u00FDch p\u0159ipojen\u00ED

#Operation to get the borrowed connections count
GetBorrowedConnectionsCountOperationDescription=Z\u00EDsk\u00E1 po\u010Det vyp\u016Fj\u010Den\u00FDch p\u0159ipojen\u00ED

#Operation to get the pool statistics
GetStatisticsOperationDescription=Z\u00EDsk\u00E1 statistiku fondu p\u0159ipojen\u00ED

#Operation to get the connection pool life cycle state
GetLifeCycleStateOperationDescription=Z\u00EDsk\u00E1 stav \u017Eivotn\u00EDho cyklu fondu p\u0159ipojen\u00ED

#Operation to get the maximum connection reuse time
GetMaxConnectionReuseTimeOperationDescription=Z\u00EDsk\u00E1 hodnotu vlastnosti MaxConnectionReuseTime

#Operation to set the maximum connection reuse time
SetMaxConnectionReuseTimeOperationDescription=Nastav\u00ED hodnotu vlastnosti MaxConnectionReuseTime

#Operation to get the maximum connection reuse count
GetMaxConnectionReuseCountOperationDescription=Z\u00EDsk\u00E1 hodnotu vlastnosti MaxConnectionReuseCount

#Operation to set the maximum connection reuse count
SetMaxConnectionReuseCountOperationDescription=Nastav\u00ED hodnotu vlastnosti MaxConnectionReuseCount

#Operation to enable/disable strict web session affinity
UseStrictWebSessionAffinityOperationDescription=Aktivuje re\u017Eim p\u0159\u00EDsn\u00E9 afinity webov\u00E9 relace

#Operation to enable/disable strict XA affinity
UseStrictXAAffinityOperationDescription=Aktivuje re\u017Eim p\u0159\u00EDsn\u00E9 afinity XA

#--------------------------------------------------------------------------
#
# JDBC Pool MBean descriptions
#
#--------------------------------------------------------------------------

#JDBC Pool MBean Constructor
JDBCMBeanConstructorDescription=Sestav\u00ED prvek JDBCUniversalConnectionPoolMBeanImpl

#JDBC Pool MBean Attributes Info

#Attribute for SQLForValidateConnection
SQLForValidateConnectionAttrDisplayName=SQLForValidateConnection
SQLForValidateConnectionAttrDescription=Nastav\u00ED a z\u00EDsk\u00E1 hodnotu vlastnosti SQLForValidateConnection

#Attribute for MaxStatements
MaxStatementsAttrDisplayName=MaxStatements
MaxStatementsAttrDescription=Nastav\u00ED a z\u00EDsk\u00E1 hodnotu vlastnosti MaxStatements

#Attribute for MaxIdleTime
MaxIdleTimeAttrDisplayName=MaxIdleTime
MaxIdleTimeAttrDescription=Nastav\u00ED a z\u00EDsk\u00E1 hodnotu vlastnosti MaxIdleTime

#Attribute for PropertyCycle
PropertyCycleAttrDisplayName=PropertyCycle
PropertyCycleAttrDescription=Nastav\u00ED a z\u00EDsk\u00E1 hodnotu vlastnosti PropertyCycle

#Attribute for FailoverEnabled
FailoverEnabledAttrDisplayName=FailoverEnabled
FailoverEnabledAttrDescription=Nastav\u00ED a z\u00EDsk\u00E1 hodnotu vlastnosti failoverEnabled

#Attribute for ONSConfiguration
ONSConfigurationAttrDisplayName=ONSConfiguration
ONSConfigurationAttrDescription=Nastav\u00ED a z\u00EDsk\u00E1 hodnotu vlastnosti ONSConfiguration


#JDBC Pool MBean Operations Info

#Operation to get the SQLForValidateConnection property value
GetSQLForValidateConnectionOperationDescription=Z\u00EDsk\u00E1 hodnotu vlastnosti SQLForValidateConnection

#Operation to set the SQLForValidateConnection property value
SetSQLForValidateConnectionOperationDescription=Nastav\u00ED hodnotu vlastnosti SQLForValidateConnection

#Operation to get the MaxStatements property value
GetMaxStatementsOperationDescription=Z\u00EDsk\u00E1 hodnotu vlastnosti MaxStatements

#Operation to set the MaxStatements property value
SetMaxStatementsOperationDescription=Nastav\u00ED hodnotu vlastnosti MaxStatements

#Operation to get the MaxIdleTime property value
GetMaxIdleTimeOperationDescription=Z\u00EDsk\u00E1 hodnotu vlastnosti MaxIdleTime

#Operation to set the MaxIdleTime property value
SetMaxIdleTimeOperationDescription=Nastav\u00ED hodnotu vlastnosti MaxIdleTime

#Operation to get the PropertyCycle property value
GetPropertyCycleOperationDescription=Z\u00EDsk\u00E1 hodnotu vlastnosti PropertyCycle

#Operation to set the PropertyCycle property value
SetPropertyCycleOperationDescription=Nastav\u00ED hodnotu vlastnosti PropertyCycle

#Operation to get the FailoverEnabled property value
GetFastConnectionFailoverEnabledOperationDescription=Z\u00EDsk\u00E1 hodnotu vlastnosti failoverEnabled

#Operation to set the FailoverEnabled property value
SetFastConnectionFailoverEnabledOperationDescription=Nastav\u00ED hodnotu vlastnosti failoverEnabled

#Operation to get the ONSConfiguration property value
GetONSConfigurationOperationDescription=Z\u00EDsk\u00E1 hodnotu vlastnosti ONSConfiguration

#Operation to set the ONSConfiguration property value
SetONSConfigurationOperationDescription=Nastav\u00ED hodnotu vlastnosti ONSConfiguration
